In [12]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['a','b','c','d']
my_data = [10,20,30,40]

##numpy array
arr = np.array(my_data)

##Dictionary
d = {'a':10, 'b':20, 'c':30, 'd':40}

#### Series

In [5]:
pd.Series(my_data, labels)

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [8]:
pd.Series(arr, labels)

a    10
b    20
c    30
d    40
dtype: int32

In [9]:
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

In [11]:
series1=pd.Series([1,2,3,4],['USA','Australia','Russia', 'NZ'])
series1

USA          1
Australia    2
Russia       3
NZ           4
dtype: int64

#### DataFrame

In [13]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [18]:
type(df['W'])

pandas.core.series.Series

In [20]:
##Access multiple columns
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [21]:
##Accessing rows
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [22]:
##Accessing rows  with index location
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [23]:
##Access a specific cell
df.iloc[0,2]

-1.7060859307350775

In [25]:
##Access a range of cells
df.iloc[0:2,2:4]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [26]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [27]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [29]:
df[df['W']>0][['Y','Z']]

          Y         Z
A -1.706086 -1.159119
C  0.638787  0.329646

In [30]:
##query multiple columns using And operator
df[(df['W']>0) & (df['Z']>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [31]:
##to reset inex to numerical value, use inplace=True
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [33]:
df['Letter'] = ['AA','BB','CC','DD','EE']
df1 = df.copy()

In [35]:
##Set a column as index to the data set, use inplace=True
df.set_index('Letter')

               W         X         Y         Z
Letter
AA      0.302665  1.693723 -1.706086 -1.159119
BB     -0.134841  0.390528  0.166905  0.184502
CC      0.807706  0.072960  0.638787  0.329646
DD     -0.497104 -0.754070 -0.943406  0.484752
EE     -0.116773  1.901755  0.238127  1.996652

#### GroupBy

In [38]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [40]:
df2 = pd.DataFrame(data)
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [44]:
df2.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [50]:
df2.groupby('Company').sum().iloc[1]

Sales    320
Name: GOOG, dtype: int64

### Merge, Join and Concatenate

In [52]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [53]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [54]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [55]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [57]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [58]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [59]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df_2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df_3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [61]:
pd.concat([df_1,df_2,df_3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11